# -*- coding: utf-8 -*-
'''
Задание 5.2
Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24
Затем вывести информацию о сети и маске в таком формате:
Network:
10        1         1         0
00001010  00000001  00000001  00000000
Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000
Проверить работу скрипта на разных комбинациях сеть/маска.
Ограничение: Все задания надо выполнять используя только пройденные темы.
'''

#input_user = input("Укажите Ip-сети в формате 10.1.1.1/24: ")
input_user = "10.1.1.1/24"

input_user = input_user.replace("/", ".")
ip = input_user.split(".")

bin_ip = []
for i in [0, 1, 2, 3, 4]:
    bin_ip.append("{:08b}".format(int(ip[i])))


print(bin_ip)

"""""
ip[0] = int(ip[0])
ip[1] = int(ip[1])
ip[2] = int(ip[2])
ip[3] = int(ip[3])
ip[4] = int(ip[4])

ip10 = "Network:\n{:<8} {:<8} {:<8} {:<8}".format(ip[0], ip[1], ip[2], ip[3])
ip2 = "\n{:<08b} {:<08b} {:<08b} {:<08b}".format(ip[0], ip[1], ip[2], ip[3])

print(ip10, ip2)

#а вот дальше не понянятно нихуя как делать
"""